# 11 Практическое занятие 2 Разработка статического веб-интерфейса с применением принципов семантической разметки и адаптивного дизайна

## О демонтрационном проекте
Видеопрокат: смысл, процессы, проблемы и возможности.

## Структура проекта
<img width="126" height="165" alt="Структура проекта" src="https://github.com/user-attachments/assets/07b0e666-be01-4d3a-a1c1-c6c24d3dd322" />

### Описание структуры:
- **Папка `images`** содержит все изображения, используемые в ходе создания проекта;
- **Папка `pages`** представляет собой набор страниц приложения (авторизация и аутентификация);
- **Файл `index.js`** - главный файл и главная страница проекта;
- **Файл `.gitignore`** нужен для добавления файлов, которые не должны попадать в Git-репозиторий;
- **Файл `README.md`** - файл для документации проекта.

  
